In [2]:
import pandas as pd

In [4]:
dic = {
    "Maths":np.random.randint(40,100,10),
    "Eng":np.random.randint(40,100,10),
    "Chem":np.random.randint(40,100,10),
    "Phy":np.random.randint(40,100,10)
}

In [1]:
import numpy as np
np.random.randint(40,100,10)

array([97, 44, 60, 64, 94, 47, 84, 45, 98, 83])

In [5]:
dic

{'Maths': array([49, 85, 56, 46, 57, 73, 50, 87, 86, 60]),
 'Eng': array([49, 86, 94, 82, 74, 89, 58, 41, 40, 91]),
 'Chem': array([83, 84, 79, 48, 80, 70, 96, 43, 65, 45]),
 'Phy': array([79, 65, 79, 58, 88, 99, 41, 89, 42, 77])}

In [6]:
df = pd.DataFrame(dic)

In [9]:
df.head(3)

   Maths  Eng  Chem  Phy
0     49   49    83   79
1     85   86    84   65
2     56   94    79   79

In [10]:
df.shape

(10, 4)

In [11]:
df.describe()

           Maths        Eng      Chem        Phy
count  10.000000  10.000000  10.00000  10.000000
mean   64.900000  70.400000  69.30000  71.700000
std    16.332993  21.391587  18.49955  19.726181
min    46.000000  40.000000  43.00000  41.000000
25%    51.500000  51.250000  52.25000  59.750000
50%    58.500000  78.000000  74.50000  78.000000
75%    82.000000  88.250000  82.25000  85.750000
max    87.000000  94.000000  96.00000  99.000000

In [12]:
df.to_csv("data.csv",index = False)

In [13]:
df.iloc[1]

Maths    85
Eng      86
Chem     84
Phy      65
Name: 1, dtype: int32

In [14]:
df.iloc[1,0]

85

In [16]:
df.loc[1,"Eng"]

86

In [19]:
df.sort_values(by = ["Maths","Eng"],ascending=False)

   Maths  Eng  Chem  Phy
7     87   41    43   89
8     86   40    65   42
1     85   86    84   65
5     73   89    70   99
9     60   91    45   77
4     57   74    80   88
2     56   94    79   79
6     50   58    96   41
0     49   49    83   79
3     46   82    48   58

In [20]:
num = df.values

In [22]:
type(num)

numpy.ndarray

In [23]:
df.columns

Index(['Maths', 'Eng', 'Chem', 'Phy'], dtype='object')

In [24]:
num

array([[49, 49, 83, 79],
       [85, 86, 84, 65],
       [56, 94, 79, 79],
       [46, 82, 48, 58],
       [57, 74, 80, 88],
       [73, 89, 70, 99],
       [50, 58, 96, 41],
       [87, 41, 43, 89],
       [86, 40, 65, 42],
       [60, 91, 45, 77]])

In [25]:
pd.DataFrame(num,columns=df.columns)

   Maths  Eng  Chem  Phy
0     49   49    83   79
1     85   86    84   65
2     56   94    79   79
3     46   82    48   58
4     57   74    80   88
5     73   89    70   99
6     50   58    96   41
7     87   41    43   89
8     86   40    65   42
9     60   91    45   77

In [26]:
dp = pd.read_csv("data.csv")

In [27]:
dp.head()

   Maths  Eng  Chem  Phy
0     49   49    83   79
1     85   86    84   65
2     56   94    79   79
3     46   82    48   58
4     57   74    80   88